var articles = [
		{
			id: "1",
			title: "Исполнители двойного убийства в Минске приговорены к пожизненному",
			summary: "Завершился суд в Минске по делу о двойном убийстве. Минский городской суд приговорил двух обвиняемых в убийстве молодой пары к пожизненному заключению. Еще одну фигурантку по данному судебному разбирательству суд приговорил к 12 годам лишения свободы.",
			createdAt: new Date("2017-06-03T19:12:00"),
			author: "lollipop",
			content: "06.03.2017 (в понедельник) оглашен приговор суда по делу о заказном убийстве молодой пары в Минске в декабре 2016 года – прокурор настаивал на смертной казни для исполнителей, суд дал пожизненное с конфискацией. Заказчица убийства своего бывшего сожителя и его подруги 27-летняя минчанка Алина Шульганова получила 12 лет колонии общего режима. Исполнители — 44-летний Александр Жильников и 23-летний Вячеслав Сухарко – пожизненное заключение с конфискацией имущества. Также они обязаны принудительно пройти лечение от алкоголизма и выплатить моральный ущерб родственникам убитых на общую сумму в 270 тысяч рублей. Напомним, убийство молодой пары в декабре 2015 года в Минске на ул. Алибегова было совершено с особой жестокостью — на теле 32-летнего мужчины было более 50 ножевых ранений, на теле 24-летней девушки – более 30. Алина Шульганова заплатила за «науку» бывшему пять миллионов (неденоминированных) рублей. Также установлен еще один факт убийства — за несколько дней до двойного убийства по заказу Жильников и Сухарко лишили жизни 59-летнего минчанина.",
			tags: ["общество","происшествия"]
		},
		{
			id: "2",
			title: "Минтранс не планирует повышать стоимость проезда до конца 2017 года",
			summary: "Тарифы на пассажирские перевозки в Беларуси в 2017 году повышать не планируется. Об этом сообщил министр транспорта и коммуникаций Беларуси Анатолий Сивак на пресс-конференции в пресс-центре БЕЛТА.",
			createdAt: new Date("2000-05-01T19:10:00"),
			author: "lollypop",
			content: "Как заявил на состоявшейся 6 марта пресс-конференции министр транспорта и коммуникаций Анатолий Сивак, по итогам прошлого года окупаемость пассажирских перевозок составила 64,2%.На 2017 год параметры бюджета заложены под 65%, то есть Минтрансу необходимо уменьшить расходы на 0,8%. При этом планов на повышение тарифов на перевозку пассажиров в этом году нет.Напомним, последний раз стоимость проезда в Беларуси повышалась в декабре 2016 года.",
			tags: ["общество"]
		},
		{
			id: "3",
			title: "В Гродно умерла одна из пострадавших на Скидельском сахарном комбинате",
			summary: "Одна из пострадавших на Скидельском сахарном комбинате скончалась в больнице в Гродно. Информацию об этом предоставили в Гродненской городской клинической БСМП. 43-летняя женщина умерла в ночь с третьего на четвертое марта.",
			createdAt: new Date("2016-05-03T19:9:00"),
			author: "lollipop",
			content: 'Состояние еще одной пострадавшей остается тяжелым", - отметили в администрации больницы. Как сообщалось, в ночь с 24 на 25 февраля в галерее Скидельского сахарного комбината, соединяющей цех упаковки и фасовки сахара с лифтовой шахтой, произошла вспышка пылевоздушной смеси без последующего горения. В результате пострадали пять сотрудниц предприятия. У всех ожоги тела - от 50% и выше, а также баротравмы. Трех пациентов 25 февраля перевезли из Гродно в Минск в реанимационное отделение Республиканского ожогового центра, еще две женщины находились в реанимации Гродненской БСМП. Управление Следственного комитета по Гродненской области возбудило уголовное дело по факту служебной халатности в ОАО "Скидельский сахарный комбинат", повлекшей по неосторожности тяжкие последствия (ст.428 УК РБ). Устанавливается размер причиненного предприятию ущерба, проводятся необходимые следственные действия.',
			tags: ["общество","происшествия"]
		},
		{
			id: "4",
			title: "Глава Россельхознадзора не собирается ехать в Белоруссию",
			summary:'Министр сельского хозяйства и продовольствия Белоруссии Леонид Заяц в ходе интервью РИА Новости пригласил главу Россельхознадзора Сергея Данкверта посетить Белоруссию для "налаживания отношений в сфере поставок продуктов".Между тем в пресс-службе Россельхознадзора отметили, что Данкверт не собирается ехать в Беларусь по приглашению Минсельхоза. Кроме того, в пресс-службе подчеркнули, что им непонятно, зачем Беларусь приглашает к себе Данкверта.',
			createdAt: new Date("2016-05-03T19:12:00"),
			author: "lollipop",
			content: 'Глава Россельхознадзора Сергей Данкверт не получал официального приглашения из Минска и не собирался ехать в Белоруссию, повода для этого нет, заявила пресс-секретарь ведомства Юлия Мелано .По ее словам, речь может идти только о поездке технических экспертов или же о визите представителей белорусской стороны в Россию. "Логично было бы, чтобы они направили запрос с целью принять их здесь, чтобы урегулировать ситуацию с поставками, поскольку речь идет не о российской, а о белорусской продукции", - отметила Мелано.',
			tags: ["общество","политика"]
		},
		{
			id: "5",
			title: "В Светлогорске пятилетний ребенок упал с балкона третьего этажа",
			summary: 'В Светлогорске пятилетний мальчик попал в реанимацию, выпав с балкона третьего этажа, сообщил официальный представитель УВД Гомельского облисполкома Виталий Пристромов. Инцидент произошел вечером 5 марта.',
			createdAt: new Date("2016-05-03T19:01:21"),
			author: "lollypop",
			content: 'Как сообщили в отделе информации и общественных связей УВД Гомельского облисполкома, ребенка заметили прохожие, которые вызвали скорую помощь и милицию. У мальчика диагностирован перелом бедра, он в реанимации, но уже пришел в сознание.По предварительной информации, мать воспитывает сына одна. Вечером она пошла к знакомой постирать белье, так как не имеет стиральной машины, а спящего сына оставила одного. Прежде чем уйти, утверждает женщина, она закрыла балконную дверь и спрятала съемную ручку. Дома мать отсутствовала около часа. Предположительно, ребенок нашел рукоятку, вышел на балкон и упал с него.Семья состоит на учете как находящаяся в социально опасном положении. Женщина с ребенком в феврале 2017 года переехала в Светлогорск из Могилевской области. В городе она устроилась на работу на овощную фабрику.Милиция проводит проверку.',
			tags: ["общество","происшествия"]
		},
		{
			id: "6",
			title: "Кобяков отправится на заседание Евразийского межправсовета.",
			summary: 'Возглавляемая премьер-министром Андреем Кобяковым правительственная делегация 6-7 марта с официальным визитом посетит Киргизию. «Премьер-министр примет участие в совещании Евразийского межправительственного совета», — подчеркнул пресс- секретарь.',
			createdAt: new Date("2017-05-03T19:18:00"),
			author: "lollipop",
			content: 'Премьер-министр Беларуси с официальным визитом отправится в Кыргызстан, где 7 марта пройдет заседание Евразийского межправительственного совета.Как сообщили в пресс-службе белорусского правительства, в Бишкеке Андрей Кобяков проведет ряд двусторонних встреч с главами правительств стран ЕАЭС.',
			tags: ["политика"]
		},
		{
			id: "7",
			title: "«Газпром» увеличил стоимость газа для Белоруссии",
			summary: 'Российская нефтегазовая компания «Газпром» увеличила стоимость газа для Белоруссии. Теперь «голубое топливо» будет экспортироваться в республику по 141,1 доллару за тысячу кубических метров. С начала текущего года «Газпром» увеличил цену на газ для Белоруссии на 6,81%',
			createdAt: new Date("2017-05-03T19:12:00"),
			author: "our-news",
			content: 'Стоимость русского газа для Беларуси с 1 января 2017 года составляет 141,1 доллара за тысячу кубометров, что на 6,81% больше, чем в 2016-ом году. Такие цифры приведены в письме заместителя председателя правления «Газпрома» Валерия Голубева министру энергетики РФ Александру Новаку. В правлении «Газпрома» отметили, что снижать цену на газ для Беларуси не будут. Наговый холдинг придерживается контракта, в котором четко прописана формула образования цены на газ: цена производства в Ямало-Ненецком округе РФ плюс цена доставки до Беларуси.+ Напомним, что в 2016 году Беларусь платила за газ в соответствии с собственными расчетами. Республика считала, что цена на газ необоснованная и платила 73 доллара за тысячу кубов. Однако «Газпром» считал это нарушением контракта и к марту 2017 года долг перед компанией составил около 600 млн долларов.',
			tags: ["политика","общество"]
		},
		{
			id: "8",
			title: "В Минске женщина выбросила в окно бутылку и разбила авто",
			summary: 'Нетрезвая жительница столицы выбросила из окна бутылку шампанского и повредила автомобиль. Информацию об этом предоставили в ГУВД Мингорисполкома. В правоохранительные органы обратился мужчина, хозяин автомобиля марки Mitsubishi.',
			createdAt: new Date("2017-04-03T19:13:00"),
			author: "CNN",
			content: 'Нетрезвая жительница столицы выбросила из окна бутылку шампанского и повредила автомобиль. Информацию об этом предоставили в ГУВД Мингорисполкома.  В правоохранительные органы обратился мужчина, хозяин автомобиля марки Mitsubishi. Он рассказал, что по возвращении домой припарковал машину и пошел в квартиру, но услышал звуки сигнализации. Выйдя во двор, он обнаружил, что у иномарки разбито лобовое стекло.  Виновницей инцидента оказалась 30-летняя минчанка. Она выпивала алкоголь, но муж сообщил, что идет домой. Женщина испугалась и выбросила тару.   Действия жительницы Минска были квалифицированы по ч.1 ст.339 УК Беларуси.',
			tags: ["общество","происшествия"]
		},
		{
			id: "9",
			title: "«Торино» оценивает Белотти в 150 миллионов евро",
			summary: 'Президент "Торино" Урбано Каиро отметил, что форвард его команды Андреа Белотти стоит не менее 150 миллионов евро. Интерес к форварду проявляют английские и китайские клубы.',
			createdAt: new Date("2016-05-03T19:12:00"),
			author: "lollipop",
			content: 'Президент итальянского "Торино" Урбано Каиро объявил приблизительную сумму, за которую клуб готов расстаться со своим нападающим Андреа Белотти."Мы прописали сумму в контракте Белотти, поэтому готовы продать его в другой чемпионат, если кто-то согласится ее заплатить. Однако, в Италии я могу отказать всем, даже если мне предложат более 100 миллионов евро. Если бы мы продавали игрока сейчас, то оценили бы его приблизительно в 150 миллионов евро. Надеюсь, никто не сможет заплатить за него такие деньги, и я буду счастлив, если он как можно дольше будет играть за "Торино", — цитирует Каиро Sky Sport Italia.',
			tags: ["спорт"]
		},
		{
			id: "10",
			title: "Чемпионат Испании. Отомстив «Сельте»,«Барселона» вернулась на вершину",
			summary: 'Как и в прошлом сезоне, "Барселона" жестоко отомстила "Сельте" за гостевое поражение. Каталонцы выдали вдохновенную игру и на всём протяжении встречи не давали усомниться в своём превосходстве, даже когда счёт стал совсем неприличным.',
			createdAt: new Date("2016-05-03T19:12:00"),
			author: "lollypop",
			content: 'Как и в прошлом сезоне, "Барселона" жестоко отомстила "Сельте" за гостевое поражение. Каталонцы выдали вдохновенную игру и на всём протяжении встречи не давали усомниться в своём превосходстве, даже когда счёт стал совсем неприличным. В итоге хозяева отгрузили в ворота соперника пять безответных голов, и такая виктория над крепким соперником не может не вдохнуть немного сдержанного оптимизма в каталонцев. Всё-таки "Сельта" - это уже не "Спортинг", в матче с которым "Барселона" покуражилась в середине недели. Правда, и ПСЖ - не клуб из Виго. Каталонцы практически сразу стали регулярно создавать моменты, но открыли счёт лишь в середине тайма - свой блестящий сольный проход увенчал голом Месси. А незадолго до перерыва Лионель помог записать свою фамилию на табло Неймару - бразилец изящно перекинул голкипера. Во втором тайме каталонцы и не подумали останавливаться, чтобы начать беречь силы к поединку с ПСЖ. В итоге Месси оформил дубль (на счету аргентинца стало уже 23 гола в чемпионате), а ещё по разу отличились Ракитич и Юмтити. Хорват, правда, забил из офсайда. Лишь только после пятого гола "Барселона" стала действовать сдержаннее. "Сельта" же могла "размочить" счёт, но Яго Аспас и Даниэль Васс свои шансы упустили. В итоге "Барселона" снова обогнала "Реал" в таблице и вернулась на первое место в Примере. И теперь все мысли каталонцев будут только о встрече с ПСЖ. "Сельту" же ждёт поединок с "Краснодаром". "Быкам" следует готовиться к "тёплому" приёму в Виго - для галисийцев Лига Европы имеет на финише сезона приоритетное значение. ',
			tags: ["общество","происшествия"]
		},
		{
			id: "11",
			title: "Исполнители двойного убийства в Минске приговорены к пожизненному",
			summary: "Завершился суд в Минске по делу о двойном убийстве. Минский городской суд приговорил двух обвиняемых в убийстве молодой пары к пожизненному заключению. Еще одну фигурантку по данному судебному разбирательству суд приговорил к 12 годам лишения свободы.",
			createdAt: new Date("2016-05-03T19:12:00"),
			author: "lollipop",
			content: "06.03.2017 (в понедельник) оглашен приговор суда по делу о заказном убийстве молодой пары в Минске в декабре 2016 года – прокурор настаивал на смертной казни для исполнителей, суд дал пожизненное с конфискацией. Заказчица убийства своего бывшего сожителя и его подруги 27-летняя минчанка Алина Шульганова получила 12 лет колонии общего режима. Исполнители — 44-летний Александр Жильников и 23-летний Вячеслав Сухарко – пожизненное заключение с конфискацией имущества. Также они обязаны принудительно пройти лечение от алкоголизма и выплатить моральный ущерб родственникам убитых на общую сумму в 270 тысяч рублей. Напомним, убийство молодой пары в декабре 2015 года в Минске на ул. Алибегова было совершено с особой жестокостью — на теле 32-летнего мужчины было более 50 ножевых ранений, на теле 24-летней девушки – более 30. Алина Шульганова заплатила за «науку» бывшему пять миллионов (неденоминированных) рублей. Также установлен еще один факт убийства — за несколько дней до двойного убийства по заказу Жильников и Сухарко лишили жизни 59-летнего минчанина.",
			tags: ["спорт"]
		},
		{
			id: "12",
			title: "Спортивный директор «Барселоны»: будем болеть за «Наполи» в матче с «Реалом»",
			summary: 'Спортивный директор «Барселоны» Арьедо Брайда рассказал, за кого каталонцы будут переживать в ответном матче 1/8 финала Лиги чемпионов между «Наполи» и «Реалом».',
			createdAt: new Date("2016-05-03T19:12:00"),
			author: "lollipop",
			content: 'Спортивный директор «Барселоны» Арьедо Брайда рассказал, за кого каталонцы будут переживать в ответном матче 1/8 финала Лиги чемпионов между «Наполи» и «Реалом». Встреча состоится 7 марта.«Из-за большого соперничества с «Реалом» в Барселоне мы будем болеть за «Наполи». Это хорошая команда, в которой есть проницательные футболисты, способные добыть победу. У «Наполи» хорошие шансы на положительный исход», — цитирует Брайду Football Italia.Матч «Наполи» — «Реал» начнётся в 22:45 мск. В первой встрече неаполитанцы уступили со счётом 1:3.',
			tags: ["спорт"]
		},
		{
			id: "13",
			title: "NASA предлагает восстановить магнитное поле Марса",
			summary: 'Большинство ученых сходятся во мнении, что около 4 млрд лет назад Марс был похож на Землю, однако из-за отсутствия магнитного поля частички солнечного ветра «сдули» атмосферу планеты, в результате чего она превратилась в безжизненную пустыню.',
			createdAt: new Date("2016-05-03T19:12:00"),
			author: "lollypop",
			content: 'Ученые считают, что это позволит восстановить атмосферу Красной планеты и повысить температуру ее поверхности, сообщает издание Phys.org. Большинство ученых сходятся во мнении, что около 4 млрд лет назад Марс был похож на Землю, однако из-за отсутствия магнитного поля частички солнечного ветра «сдули» атмосферу планеты, в результате чего она превратилась в безжизненную пустыню.Джим Грин, руководитель планетологического отделения NASA, и его коллеги предлагают запустить к Марсу искусственный магнитный щит, который будет защищать планету от солнечного ветра, а также не позволит воздуху Марса испаряться в космос.В будущем, как отмечают ученые, это магнитное поле приведет к повышению температуры на Красной планете и таянию ледников, после чего планету можно будет заселить живыми организмами. ',
			tags: ["наука"]
		},
		{
			id: "14",
			title: "Учёные: Социальные сети могут привести к изоляции от реальности‍",
			summary: 'Американские учёные определили, что социальные сети могут привести к изоляции от реальности. Специалисты считают, что из-за такого отношения начинается уже настоящая эпидемия среди молодых людей',
			createdAt: new Date("2016-05-03T19:12:00"),
			author: "lollipop",
			content: 'Американские учёные определили, что социальные сети могут привести к изоляции от реальности. Специалисты считают, что из-за такого отношения начинается уже настоящая эпидемия среди молодых людей.По мнению исследователей, уровень зависимости от Интернет-общения с каждым днём растёт всё больше и больше. Школьники и студенты от этого иногда начинают хуже учиться, а уже работающие – меньше работать. Имеет место существенная разница в том, как себя проявляет в реальной жизни человек, который не сидит в Интернете, от того, кто там сидит, и разница эта, по мнению учёных, в негативную сторону. В то же время, исследователи пока всё-таки не могут точно утверждать, факт социальной изоляции привёл к желанию общаться в Интернете или же, наоборот, общение в Интернете развивает социальную изоляцию. Потому они не рекомендуют любителям поболтать в Интернете тут же перестать это делать, а всего лишь просят психологов, когда тем жалуются на одиночество, обратить на это внимание.',
			tags: ["наука"]
		},
		{
			id: "15",
			title: "Apple iPhone 8 получит OLED-экран диагональю 5,8 дюймов",
			summary: 'Аналитик KGI Securities Мин-Чи Куо подтвердил предположение китайского СМИ Nikkei Asian Review о том, что новый Apple iPhone 8 получит OLED-экран диагональю 5,8 дюймов. Ранее ресурсы утверждал, что смартфон будет 5,5-дюймовым. Предполагается, что iPhone 8 предложат покупателям в трех конфигурациях.',
			createdAt: new Date("2016-05-03T19:12:00"),
			author: "lollypop",
			content: 'Аналитик KGI Securities Мин-Чи Куо подтвердил предположение китайского СМИ Nikkei Asian Review о том, что новый Apple iPhone 8 получит OLED-экран диагональю 5,8 дюймов. Ранее ресурсы утверждал, что смартфон будет 5,5-дюймовым.Apple iPhone 8 получит OLED-экран диагональю 5,8 дюймов.Предполагается, что iPhone 8 предложат покупателям в трех конфигурациях. Самая большая - с OLED-экраном диагональю 5,8 дюймов. Скорее всего, удалось достичь таких больших размеров смартфона благодаря еще большему уменьшению боковых рамок. Стоимость ТОПовой конфигурации стартует с отметки 1000 долларов.Также инсайдеры сообщают, что задняя панель Apple iPhone 8 будет выполнена из стекла. Это позволит внедрить технологию беспроводной зарядки. Корпус будет создавать компания Biel & Lens. Презентация iPhone 8 пройдет в октябре или ноябре 2017 года, а старт производства намечен на сентябрь',
			tags: ["технологии"]
		},
		{
			id: "16",
			title: "Названы самые популярные мессенджеры в России",
			summary: '«ВымпелКом» оценил популярность мессенджеров среди своих абонентов.WhatsApp оказался самым популярным мессенджером и среди абонентов «МегаФона». По итогам 2016 года сервис занимал 47,6% среди абонентов, которые хотя бы один раз в месяц пользовались мессенджерами, рассказал РБК представитель пресс-службы «МегаФона».Следом за ним идет Viber, а замыкает тройку приложение Skype.',
			createdAt: new Date("2016-05-03T19:12:00"),
			author: "lollipop",
			content: 'Российская телекоммуникационная компания «ВымпелКом» и оператор «Мегафон» оценили все используемые в России месенджеры и назвали наиболее популярные. Об этом сообщил сайт РБК.По версии «ВымпелКом», самым популярным мессенджером среди российских пользователей мобильных устройств оказался WhatsApp. Следом за ним идет Viber, а замыкает тройку приложение Skype.WhatsApp использует 68,7% абонентов «ВымпелКома», Viber — 45,7%, а Skype — 38,3%. Что касается приложения Telegram, на долю которого приходится 7,5% абонентов, оно оказалось сервисом с наиболее активно растущей аудиторией.Среди абонентов «Мегафона» приложение WhatsApp использует 47,6% пользователей, Viber — 39,6%, а Skype — 17,9%.Аудитория мессенджера превышает миллиард человек. Среди россиян этот сервис использует более 30 миллионов граждан. Хотя бы раз в месяц в приложение WhatsApp заходили 10,2 миллиона человек в России. У Viber этот показатель не превышает восемь миллионов пользователей.',
			tags: ["технологии","общество"]
		},
		{
			id: "17",
			title: "«Ответственное поведение педагогов в сети»: МТС и Министерство образования провели семинар в Минске",
			summary: 'Спикером мероприятия, организованного командой МТС и Министерством образования Республики Беларусь, стала кандидат психологических наук, доцент Российской академии государственной службы при президенте РФ, внештатный сотрудник Фонда развития интернета Виктория Измагурова.',
			createdAt: new Date("2016-05-03T19:12:00"),
			author: "lollipop",
			content: 'Современные технологии и интернет оказывают значительное влияние на формирование личности, ее привычек, а часто становятся главной площадкой для коммуникации. Сегодня 96% учителей используют социальные сети в личных целях, более 70% из них добавляют своих учеников в «друзья». Что может влиять на репутацию педагога в виртуальном пространстве, как правильно выстраивать общение с детьми в интернете? Эти и многие другие вопросы накануне обсуждали в Минском институте развития образования на семинаре «Ответственное поведение педагога в сети».Спикером мероприятия, организованного командой МТС и Министерством образования Республики Беларусь, стала кандидат психологических наук, доцент Российской академии государственной службы при президенте РФ, внештатный сотрудник Фонда развития интернета Виктория Измагурова. Представляя гостью, директор ГИАЦ Министерства образования Республики Беларусь Павел Лис, акцентировал внимание на  важности серьезного подхода учителя к использованию современных ресурсов. По его мнению, обучение ребенка дома и в школе, постоянное общение и доверительные отношения с ним могут оградить от онлайн-рисков более эффективно, чем любые технологии информационной фильтрации.',
			tags: ["общество","технологии"]
		},
		{
			id: "18",
			title: "Литва установит 150 сирен на случай аварии на БелАЭС‍",
			summary: 'Управление пожарной безопасности Литвы намерено установить в Вильнюсе и Вильнюсском районе, а также в Ширвинтском и Шальчининским районах предупредительные сирены. Они будут размещены в 150-ти местах в радиусе 50 км от БелАЭС.',
			createdAt: new Date("2016-05-03T19:12:00"),
			author: "lollipop",
			content: 'Управление пожарной безопасности Литвы намерено установить в Вильнюсе и Вильнюсском районе, а также в Ширвинтском и Шальчининским районах предупредительные сирены. Они будут размещены в 150-ти местах в радиусе 50 км от БелАЭС.Установка 150-ти сирен включена в программу правительства. На ее реализацию потребуется около 3-х миллионов евро. Сирены необходимы для информирования об опасности в случае аварии на белорусской АЭС и превышении радиоационного фона.',
			tags: ["общество"]
		},
		{
			id: "19",
			title: "FT: банковская система Китая стала крупнейшей в мире по объему активов",
			summary: 'FT: банковская система Китая стала крупнейшей в мире по объему активов‍.Банковская система Китая по итогам 2016 года обошла по объему активов Евросоюз и стала крупнейшей в мире. Об этом сообщает газета Financial Times со ссылкой на собственное исследование. По размеру ВВП Китай обошел Евросоюз еще в 2011 году.',
			createdAt: new Date("2016-05-03T19:12:00"),
			author: "lollipop",
			content: 'Банковская система Китая по итогам 2016 года обошла по объему активов Евросоюз и стала крупнейшей в мире.Об этом сообщает газета Financial Times со ссылкой на собственное исследование.По размеру ВВП Китай обошел Евросоюз еще в 2011 году.Согласно итогам прошлого года, банковские активы КНР достигли $33 трлн по сравнению с $31 трлн еврозоны, $16 трлн США и $7 трлн Японии.В то же время, по свидетельству аналитиков FT, нынешнее достижение банковской системы КНР свидетельствует о растущей зависимости китайской экономики от долгового финансирования с целью стимулирования экономического роста после глобального финансового кризиса.Очень большие размеры банковской системы Китая, по словам экономиста из Корнелльского университета в США Эшвара Прасада, указывают "на сильную зависимость от банковского финансирования", усугубляемую, в частности, "огромными кредитными рисками".',
			tags: ["экономика","политика"]
		},
		{
			id: "20",
			title: "Украина в суде ООН обвинила Россию в поддержке терроризма‍",
			summary: 'Киев на слушаниях в Международном суде ООН обвинил Москву в поддержке терроризма и поставках оружия на Украину, а также дискриминации крымских татар и украинцев на территории Крыма.',
			createdAt: new Date("2016-05-03T19:12:00"),
			author: "lollipop",
			content: 'Киев на слушаниях в Международном суде ООН обвинил Москву в поддержке терроризма и поставках оружия на Украину, а также дискриминации крымских татар и украинцев на территории Крыма. В Москве в действиях украинской стороны видят стремление не урегулировать существующие разногласия, а лишь найти повод для обращения против России в международные судебные инстанции.Слушания начались в понедельник с представления позиции украинской стороны. Российская делегация выступит с ответным словом во вторник. В среду свой ответ подготовит Киев. Завершатся слушания в четверг реакцией России.Киев утверждает, что Москва якобы нарушила две конвенции — о борьбе с финансированием терроризма и о ликвидации всех форм расовой дискриминации.Выступая в ходе судебного заседания, глава украинской делегации, заместитель министра иностранных дел Украины Елена Зеркаль обвинила Россию в поддержке терроризма и расовой дискриминации, а также в "пропаганде, подрывной деятельности, запугивании, политической коррупции и кибератаках".Она потребовала от суда ввести временные меры. Такие меры, как правило, вводятся с целью заморозить развитие конфликтной ситуации, предотвратить ее ухудшение до того, как суд не вынесет окончательное решение. Согласно позиции Киева, подобный шаг необходим для защиты от боевых действий гражданского населения Украины. Профессор Йельского университета Гарольд Кох, также представляющий интересы Киева в процессе, считает, что, если суд не примет надлежащие меры, то сбившая малайзийский Boeing пусковая установка "может снова оказаться на территории Украины".Среди временных мер, которые предлагает учредить Киев, значатся "введение Россией должного контроля за своей границей", "прекращение перевода с территории РФ денежных средств, перехода военнослужащих из России, поставок оружия, транспортных средств, оборудования группировкам, вовлеченным в акты терроризма против мирного населения Украины". Кроме того, Киев предлагает побудить Москву "воздержаться от каких-либо форм расовой дискриминации против населения и институтов, находящихся под российским контролем, в том числе на Крымском полуострове". Украинская сторона призывает Россию "прекратить политическое и культурное давление против украинцев в Крыму, в том числе отменить ограничения на обучение на украинском языке".Таким образом, в настоящее время слушания не идут по существу. Согласно процедуре, суд должен вынести решение о необходимости временных мер в течение максимум четырех недель. Сам же процесс, вероятно, займет месяцы, а то и годы.оссийскую позицию на слушаниях представят директор правового департамента МИД Роман Колодкин, глава департамента по вопросам новых вызовов и угроз Илья Рогачев и заместитель директора департамента по гуманитарному сотрудничеству и правам человека российского внешнеполитического ведомства Григорий Лукьянцев. От России в Гаагу приехали также представители Росфинмониторинга, Федерального агентства по делам национальностей и ряда других ведомств — всего более 30 человек.Примечательно, что один из выступивших в понедельник в защиту украинской позиции, юрист Гарольд Кох, ранее занимал должность советника госдепартамента США при Хиллари Клинтон.',
			tags: ["общество","политика"]
		}
		];

var tags = [
	"общество","наука","политика","спорт","происшествия","технологии","экономика"
	];

function compareDate(a,b){
	if (a.createdAt < b.createdAt){
		return 1;
	} else {
		return -1;
	}
}

function getArticles(skip,top,filterConfig, articles){
	skip = skip || 0;
	top = top || 5;
	filterConfig = filterConfig || null;
	if (filterConfig != null) {
		filterConfig.tags = filterConfig.tags || [];
	}	
	filterConfig.createdAt = filterConfig.createdAt || new Date("0000-00-00T00:00:00");
	var sortedArticles = [];

	for (var i = 0; i < articles.length; ++i) {
		if (articles[i].id == filterConfig.id || articles[i].title == filterConfig.title ||
			articles[i].summary == filterConfig.summary ||
			articles[i].createdAt.getTime() == filterConfig.createdAt.getTime() ||
			articles[i].author == filterConfig.author ||
			articles[i].content == filterConfig.content ||
			containsTag(articles[i].tags, filterConfig.tags)) {
			sortedArticles.push(articles[i]);
		}
	}

	sortedArticles = sortedArticles.slice(skip, skip + top);
	sortedArticles.sort(compareDate);
	return sortedArticles;
}

function getArticle(articleId, articles){
	for (var i = 0; i < articles.length; ++i){
		if (articles[i].id == articleId) {
			return articles[i];
		}
	}
	return null;
}

function validateArticle(article, tags){
	if (article.id != undefined && article.title.length > 0 &&
		article.title.length < 100 &&
		article.summary.length > 0 && article.summary.length < 200 &&
		article.createdAt != undefined && article.author.length > 0 &&
		article.content.length > 0 &&
		validateTags(article.tags, tags) && article.tags.length > 0) {
		return true;
	} else {
		return false;
	}
}

function addArticle(newArticle, articles, tags){
	if (validateArticle(newArticle, tags)) {
		articles.push(newArticle);
		return true;
	} else {
		return false;
	}
}

function editArticle(id, newArticle, articles, tags){
	var oldArticle = getArticle(id, articles);
	newArticle.id = oldArticle.id;
	newArticle.createdAt = oldArticle.createdAt;
	newArticle.author = oldArticle.author;
	if (validateArticle(newArticle, tags)) {
		oldArticle.title = newArticle.title;
		oldArticle.summary = newArticle.summary;
		oldArticle.content = newArticle.content;
		oldArticle.tags = newArticle.tags;
		return true;
	} else {
		return false;
	}

}

function removeArticle(articleId, articles){
	for (var i = 0; i < articles.length; ++i){
		if (articles[i].id == articleId) {
			articles.splice(i, 1);
		}
	}
}

function containsTag(tagsArray, tagsContainable){
	if (tagsContainable == null) {
		return false;
	}
	for (var i = 0; i < tagsContainable.length; ++i) {
		if (tagsArray.indexOf(tagsContainable[i].toLowerCase()) > 0) {
			return true;
		}
	}
	return false;
}
function validateTags(tagsValidate, tags){
	for (var i = 0; i < tagsValidate.length; ++i) {
		if (tags.indexOf(tagsValidate[i]) < 0) {
			return false;
		}
	}
	return true;
}

function addTag(newTag, tags){
	if (tags.indexOf(newTag.toLowerCase()) < 0) {
		tags.push(newTag.toLowerCase());
		return true;
	} else {
		return false;
	}
}

function removeTag(tagToDelete, tags){
	for (var i = 0; i < tags.length; i++) {
		if(tags[i] == tagToDelete.toLowerCase()){
			tags.splice(i,1);
		}
	}
}



console.log(articles);
console.log(tags);
console.log(getArticles(0, 5, {author: "lollypop"}, articles));
console.log(getArticles(0, 10, {tags: ["общество","политика","происшествия"]}, articles));
console.log(getArticles(0,3,{createdAt: new Date("2016-05-03T19:12:00")},articles));
console.log(getArticles(null, null, {tags: ["общество"] }, articles));
